cases/Benchmarking/shippingBox_convection_2D_symmetry_coarse/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Where to get surface from: either from surface ('surface') or
// from (flipped) patch of existing case ('patch')
constructFrom patch;    //surface;

// If construct from (flipped) patch
sourceCase ".";
sourcePatches (front);
exposedPatchName back;

// Flip surface normals before usage.
flipNormals false;

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false; //true;


extrudeModel 		plane;

nLayers          1; // was 20;

thickness      0.1;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

